#version: 0.2
i s
a t
e e
e r
o o
a a
a l
c t
g r
h is
i n
i t
t his
a d
a m
a p
a z
b l
b aa
c e
d u
d is
e d
e l
e at
e ct
f it
f ect
g oo
h o
i bl
i ce
k s
l o
n e
n o
o r
o w
o in
o du
p r
p er
p ho
p oin
q u
r ibl
s o
s er
t er
t ed
v e
v ice
w oo
w el
w or
ee at
ee eeat
al l
al it
gr eat
gr eeeeat
in g
am az
ap poin
baa ad
dis appoin
goo d
lo ve
no t
odu ct
pr oduct
